In [1]:
df = pd.DataFrame({'From_To':['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
                  'FlightNumber': [10045, np.nan, 10065,np.nan, 10085],
                  'RecentDelays': [[23,47],[],[24,43,87],[13],[67,32]],
                  'Airline': ['KLM(!)', '<Air France>(12)','(British Airways.)','12.Air France', "Swiss Air"]})

In [2]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]       12.Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

# 1.some values are missing in flight number column we need to replace those with an increase of 10 for every row

In [3]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [4]:
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris         10045      [23, 47]              KLM(!)
1      MAdrid_miLAN         10055            []    <Air France>(12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis         10075          [13]       12.Air France
4   Brussels_londOn         10085      [67, 32]           Swiss Air

In [5]:
tempdf = pd.DataFrame()
tempdf['From'] = df['From_To'].str.split('_').str[0].str.capitalize()
tempdf['To'] = df['From_To'].str.split('_').str[1].str.capitalize()
df.pop('From_To')
df = pd.concat([df,tempdf[['From','To']]],axis= 1)
df

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    London      Paris
1         10055            []    <Air France>(12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways.)    London  Stockholm
3         10075          [13]       12.Air France  Budapest      Paris
4         10085      [67, 32]           Swiss Air  Brussels     London

In [6]:
df

   FlightNumber  RecentDelays             Airline      From         To
0         10045      [23, 47]              KLM(!)    London      Paris
1         10055            []    <Air France>(12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways.)    London  Stockholm
3         10075          [13]       12.Air France  Budapest      Paris
4         10085      [67, 32]           Swiss Air  Brussels     London

In [7]:
delays = pd.DataFrame(df.RecentDelays.values.tolist())
delays.columns = ['delay_1', 'delay_2', 'delay_3']
df.pop('RecentDelays')
df = pd.concat([df, delays[['delay_1', 'delay_2', 'delay_3']]], axis=1)
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France>(12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways.),London,Stockholm,24.0,43.0,87.0
3,10075,12.Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN